package self.studyJava;

public class Day_0807 {
    // 실무에서 스프링
    /*1. 메인
    기존에 프로그램 개발을 진행하며, 계산기 프로그램을 작성했다.
    => 일일이 눈으로, 콘솔에서, 계산 결과를 확인해야 하는 단점

    2. Junit 사용
    -> 한번에 하나의 메소드에 집중
    -> 프로그램을 통해 결과값 혹인을 자동화 (셋팅값 3, 더하기 메소드 실행 1+2)
    리펙토링 [
        규칙 1 : 인덴트, 즉 들여쓰기를 1단계로 유지한다, while문 한번 if문 한번 하면 깊이는 2가 된다.
        규칙 2 : 특히 else문을 사용하지 않도록 권장한다.
        규칙 3 : 메소드가 한 가지 책임만 지도록 구현한다.

        if (text == null ) {
        retirn 0; }

        *** 각 단계의 개발 과정은 구현 -> 테스트를 통핱 결과 확인 -> 리펙토링 순으로 진행한다.
    *
    * */
}
